#!/usr/bin/env python
# -*- coding: utf-8 -*-

import json
import os
import mysql.connector
from datetime import date, datetime, timedelta
from peewee import *
import string
import codecs

from election_class import *

candidate_data = {"2112002":[
	["새누리당",1,"나경원","F","1963-12-06"],
	["새정치민주연합",2,"기동민","M","1966-02-23"],
	["통합진보당",3,"유선희","F","1966-10-12"],
	["정의당",4,"노회찬","M","1956-08-31"],
	["노동당",5,"김종철","M","1970-10-15"]],
"2260901":[
	["새누리당",1,"배덕광","M","1948-06-22"],
	["새정치민주연합",2,"윤준호","M","1967-06-07"]],
"2290502":[
	["새누리당",1,"송환기","M","1952-01-20"],
	["새정치민주연합",2,"권은희","F","1974-02-15"],
	["통합진보당",3,"장원섭","M","1966-01-13"],
	["정의당",4,"문정은","F","1986-08-21"],
	["무소속",5,"양청석","M","1960-06-30"]],
"2300501":[
	["새누리당",1,"정용기","M","1962-06-01"],
	["새정치민주연합",2,"박영순","M","1964-12-07"]],
"2310202":[
	["새누리당",1,"박맹우","M","1951-12-06"],
	["무소속",5,"송철호","M","1949-05-26"]],
"2410201":[
	["새누리당",1,"정미경","F","1965-09-17"],
	["새정치민주연합",2,"백혜련","F","1967-02-17"],
	["통합진보당",3,"윤경선","F","1965-04-18"],
	["정의당",4,"박석종","M","1966-08-14"]],
"2410301":[
	["새누리당",1,"김용남","M","1970-02-14"],
	["새정치민주연합",2,"손학규","M","1947-11-22"],
	["통합진보당",3,"임미숙","F","1970-05-10"],
	["정의당",4,"이정미","F","1966-02-07"],
	["무소속",5,"강방원","M","1968-04-10"],
	["무소속",6,"이계종","M","1973-06-20"]],
"2410401":[
	["새누리당",1,"임태희","M","1956-12-01"],
	["새정치민주연합",2,"박광온","M","1957-03-26"],
	["통합진보당",3,"김식","M","1983-01-09"],
	["정의당",4,"천호선","M","1962-09-10"],
	["노동당",5,"정진우","M","1969-08-19"]],
"2411502":[
	["새누리당",1,"유의동","M","1971-06-23"],
	["새정치민주연합",2,"정장선","M","1958-03-16"],
	["무소속",5,"김득중","M","1970-02-25"]],
"2413901":[
	["새누리당",1,"홍철호","M","1958-08-13"],
	["새정치민주연합",2,"김두관","M","1959-04-10"],
	["정의당",4,"김성현","M","1966-04-02"],
	["무소속",5,"고의진","M","1963-01-12"],
	["무소속",6,"이재포","M","1960-03-16"]],
"2430301":[
	["새누리당",1,"이종배","M","1957-05-30"],
	["새정치민주연합",2,"한창희","M","1954-05-01"],
	["통합진보당",3,"김종현","M","1979-10-09"]],
"2440501":[
	["새누리당",1,"김제식","M","1957-07-10"],
	["새정치민주연합",2,"조한기","M","1966-09-25"],
	["무소속",5,"박태권","M","1946-09-27"]],
"2460402":[
	["새누리당",1,"이정현","M","1958-09-01"],
	["새정치민주연합",2,"서갑원","M","1962-06-24"],
	["통합진보당",3,"이성수","M","1969-04-28"],
	["무소속",5,"김동철","M","1954-05-15"],
	["무소속",6,"구희승","M","1962-11-15"]],
"2460601":[
	["새누리당",1,"김종우","M","1957-10-18"],
	["새정치민주연합",2,"신정훈","M","1964-12-06"],
	["무소속",5,"강백수","M","1957-01-09"]],
"2462202":[
	["새누리당",1,"이중효","M","1960-12-28"],
	["새정치민주연합",2,"이개호","M","1959-06-23"]]
}

parties = {}

election = election_info.get( election_info.elec_date == "2014-07-30" )
print election.elec_title

for elec_area_cd in candidate_data.keys():
	ea = elec_area_info.get( elec_area_info.elec_cd == elec_area_cd )
	print elec_area_cd, ea.elec_nm
	for p in candidate_data[elec_area_cd]:
		party_nm, candidate_num, person_nm, person_sex, person_birthdate = p
		person = person_info()
		person.name = person_nm
		person.sex = person_sex
		person.birthdate = person_birthdate
		person.save()
		party = party_info()
		if party_nm in parties.keys():
			party = parties[party_nm]
		else:
			party.party_nm = party_nm
			party.valid_to = "9999-12-31"
			party.valid_from = "2014-01-01"
			party.save()
			parties[party_nm] = party
		candidate = candidate_info()
		candidate.candidate_num = candidate_num
		candidate.election_info = election.id
		candidate.person_info = person.id
		candidate.party_info = party.id
		candidate.save()
		print ea.elec_nm, party_nm.decode('utf-8') , person_nm.decode('utf-8')